// Задача: Написать программу, которая на вход принимает число и выдает его квадрат.
Console.WriteLine("Введите целое число");
int n = Convert.ToInt32(Console.ReadLine());
Console.Write(n*n);
